# 12. Grouping and Aggregating with Multiple Columns

In [1]:
import pandas as pd
emp = pd.read_csv('data/employee.csv')
emp.head()

,title,dept,salary,race,gender,experience
0,POLICE OFFICER,Houston Police Department-HPD,45279.0,White,Male,1
1,ENGINEER/OPERATOR,Houston Fire Department (HFD),63166.0,White,Male,34
2,SENIOR POLICE OFFICER,Houston Police Department-HPD,66614.0,Black,Male,32
3,ENGINEER,Public Works & Engineering-PWE,71680.0,Asian,Male,4
4,CARPENTER,Houston Airport System (HAS),42390.0,White,Male,3

## Review grouping and aggregating with a single column

### `df.groupby('<grouping column>').agg({'<aggregating column>':'<aggregating function>'})`

Let's see this again by calculating the average years of experience for each gender.

In [2]:
emp.groupby('gender').agg({'experience': 'mean'})

        experience
gender
Female   12.945000
Male     14.082819

# Grouping with Multiple Columns
Use a list:

In [ ]:
emp.groupby(['race', 'gender']).agg({'experience': 'mean'})

### What happened to our index?
Both race and gender are not columns and have been pushed into the index. This is a special called a **multi-level index** and technically a **`MultiIndex`** object. **`Race`** and **`Gender`** are considered **levels** of the index. They are NOT columns. You'll notice that duplicated values do not repeat in an index when they immediately follow one another.

### The MultiIndex is confusing and not necessary for beginners
In my opinion, this multi-level index only adds to confusion. Let's use `reset_index` to move it.

In [3]:
emp.groupby(['race', 'gender']).agg({'experience': 'mean'}).reset_index()

              race  gender  experience
0            Asian  Female   16.277778
1            Asian    Male   13.695652
2            Black  Female   13.603865
3            Black    Male   12.945338
4         Hispanic  Female   10.600000
5         Hispanic    Male   12.288256
6  Native American  Female   17.000000
7  Native American    Male   15.750000
8            White  Female   13.305556
9            White    Male   15.951064

# Aggregating Multiple Columns
Use multiple entries in the dictionary in `agg`

In [4]:
emp.groupby('gender').agg({'salary': 'mean', 'experience': 'max'})

              salary  experience
gender
Female  50983.082500          37
Male    58145.059031          58

# Grouping and Aggregating with Multiple Columns
Combine the last two approaches:

In [5]:
emp.groupby(['race', 'gender']).agg({'salary': 'mean', 'experience': 'max'}).reset_index()

              race  gender        salary  experience
0            Asian  Female  58304.222222          35
1            Asian    Male  60622.956522          39
2            Black  Female  48133.381643          37
3            Black    Male  51853.000000          48
4         Hispanic  Female  44216.960000          37
5         Hispanic    Male  55493.064057          38
6  Native American  Female  58844.333333          21
7  Native American    Male  68850.500000          25
8            White  Female  66415.527778          35
9            White    Male  63439.195745          58

# Multiple Aggregation Functions
Use a list as the values in the dictionary

In [ ]:
emp.groupby('race').agg({'salary': ['min', 'max', 'mean']}).reset_index()

## What's up with those column names???
Pandas created a **multi-level column index** with two levels. These are difficult to work with.

## Renaming all the columns
I recommend renaming all the columns after the aggregation. This is simple, but tedious. Simply assign the DataFrame's **`columns`** attribute to a list of desired column names.

In [6]:
race_salary = emp.groupby('race').agg({'salary': ['min', 'max', 'mean']}).reset_index()
race_salary.columns = ['RACE', 'Min Salary', 'Max Salary', 'Mean Salary']
race_salary

              RACE  Min Salary  Max Salary   Mean Salary
0            Asian     26125.0    163228.0  60143.218391
1            Black     24960.0    186192.0  50366.588803
2         Hispanic     26104.0    165216.0  52533.456693
3  Native American     49379.0     81239.0  64562.142857
4            White     26125.0    210588.0  63834.575646

If you are not planning on using the returned DataFrame then you don't need to bother renaming the columns, but having a single level index is going to be much easier to work with than a MultiIndex when you are first beginning your Pandas journey. 

## No added functionality of a MultiIndex

# Multiple Grouping Columns, Aggregating Columns, and Aggregating Functions
You can make complex aggregations by having multiple grouping columns, aggregating columns, and aggregating functions.

In [7]:
rg_sal_exp = emp.groupby(['race', 'gender']) \
                .agg({'salary': ['min', 'max', 'mean'],
                      'experience': ['max', 'std']}).reset_index()
rg_sal_exp

              race  gender   salary                         experience  \
                                min       max          mean        max
0            Asian  Female  26125.0   95950.0  58304.222222         35
1            Asian    Male  27914.0  163228.0  60622.956522         39
2            Black  Female  24960.0  150416.0  48133.381643         37
3            Black    Male  26125.0  186192.0  51853.000000         48
4         Hispanic  Female  26125.0   96157.0  44216.960000         37
5         Hispanic    Male  26104.0  165216.0  55493.064057         38
6  Native American  Female  49379.0   68299.0  58844.333333         21
7  Native American    Male  55461.0   81239.0  68850.500000         25
8            White  Female  30888.0  178331.0  66415.527778         35
9            White    Male  26125.0  210588.0  63439.195745         58


         std
0   9.868581
1   9.575250
2   9.207299
3   9.934636
4   8.744407
5   9.050977
6   4.000000
7   8.098354
8  10.024813
9  10.751494

Again, I suggest renaming the columns for easier data manipulation.

In [8]:
rg_sal_exp.columns = ['race', 'gender', 'Min Salary', 'Max Salary', 'Mean Salary', 'Max Exp', 'Std Exp']
rg_sal_exp

,race,gender,Min Salary,Max Salary,Mean Salary,Max Exp,Std Exp
0,Asian,Female,26125.0,95950.0,58304.222222,35,9.868581
1,Asian,Male,27914.0,163228.0,60622.956522,39,9.575250
2,Black,Female,24960.0,150416.0,48133.381643,37,9.207299
3,Black,Male,26125.0,186192.0,51853.000000,48,9.934636
4,Hispanic,Female,26125.0,96157.0,44216.960000,37,8.744407
5,Hispanic,Male,26104.0,165216.0,55493.064057,38,9.050977
6,Native American,Female,49379.0,68299.0,58844.333333,21,4.000000
7,Native American,Male,55461.0,81239.0,68850.500000,25,8.098354
8,White,Female,30888.0,178331.0,66415.527778,35,10.024813
9,White,Male,26125.0,210588.0,63439.195745,58,10.751494

# Getting the size of each group
Let's say we just want to know the number of rows in each group. The correct aggregation function is **`size`** and not **`count`** (this returns the number of non-missing values).

In [9]:
emp.groupby(['race', 'gender']).agg({'salary': 'size'})

                        salary
race            gender
Asian           Female      18
                Male        69
Black           Female     207
                Male       311
Hispanic        Female     100
                Male       281
Native American Female       3
                Male         4
White           Female      72
                Male       470

### The aggregating column doesn't matter
The same result will be returned regardless of what aggregating column we use since the size only depends on the number of rows and not on the actual values in the column. Using the department column does not change the output.

In [ ]:
emp.groupby(['race', 'gender']).agg({'dept': 'size'})

## Alternative Syntax for size
You can call the **`size`** method directly after grouping. This will return the same data as a Series.

In [10]:
emp.groupby(['race', 'gender']).size()

race             gender
Asian            Female     18
                 Male       69
Black            Female    207
                 Male      311
Hispanic         Female    100
                 Male      281
Native American  Female      3
                 Male        4
White            Female     72
                 Male      470
dtype: int64

# Exercises

### Problem 1
<span  style="color:green; font-size:16px">For each department and gender find the number of unique position titles, the total number of employees and the average salary. Make sure there is no multi-index for the index or columns.</span>

In [ ]:
# your code here

### Problem 2
<span  style="color:green; font-size:16px">For each department, race and gender find the maximum years of experience and salary.</span>

In [ ]:
# your code here

## Use the college dataset for the rest of the problems

In [ ]:
college = pd.read_csv('data/college.csv')
college.head()

### Problem 3
<span  style="color:green; font-size:16px">Which city name appears the most frequently. Do this in two different ways. Do it once with and once without the `groupby` method?</span>

In [ ]:
# your code here

### Problem 4
<span  style="color:green; font-size:16px">Find the maximum undergraduate population for each state?</span>

In [ ]:
# your code here

### Problem 5
<span  style="color:green; font-size:16px">Do distance only schools tend to have more or less student population than non-distance-only schools?</span>

In [ ]:
# your code here

### Problem 6
<span  style="color:green; font-size:16px">What state has the lowest percentage of currently operating schools of those that have religious affiliation?</span>

In [ ]:
# your code here